//
//  task4.cpp
//  лабораторная работа
//
//  Created by Коля on 13/10/2019.
//  Copyright © 2019 Коля. All rights reserved.
//

#include "task4.h"

симв * sum(симв * x, симв * y)
{
    стд::строка а (x), б(y);
    если(а.разм() < б.разм())
        стд::обмен(а, б);

    целоч ж = (целоч) а.разм()-1;
    для(целоч и=(целоч) б.разм()-1; и>=0; и--, ж--)
        а[ж]+=(целоч) (б[и]-'0');

    для(целоч и=(целоч) а.разм()-1; и>0; и--)
    {
        если(а[и] > '9')
        {
            целоч д = а[и]-'0';
            а[и-1] = ((а[и-1]-'0') + д/10) + '0';
            а[и] = (д%10)+'0';
        }
    }
    
    если(а[0] > '9')
    {
        стд::строка к;
        к+=а[0];
        а[0] = ((а[0]-'0')%10)+'0';
        к[0] = ((к[0]-'0')/10)+'0';
        а = к + а;
    }
    возврат стрдуп(а.си_стр());
}
